In [1]:
import pandas as pd
import numpy as np
import re
import time

from pathlib import Path
from collections import Counter

In [2]:
# File imports
metadata_path = "Data/movies_metadata_clean.csv"
ratings_path = "Data/ratings_clean.csv"
cast_path = "Data/cast_clean.csv"
crew_path = "Data/crew_clean.csv"
movies_path = "Data/movies_clean.csv"

In [3]:
meta_df = pd.read_csv(metadata_path, low_memory=False)
ratings_df = pd.read_csv(ratings_path, low_memory=False)
cast_df = pd.read_csv(cast_path, low_memory=False)
crew_df = pd.read_csv(crew_path, low_memory=False)
movies_df = pd.read_csv(movies_path, low_memory=False)

In [4]:
meta_df = meta_df.drop(columns="Unnamed: 0")
meta_df.head()

      id release_date  runtime                        title
0    862   1995-10-30     81.0                    Toy Story
1   8844   1995-12-15    104.0                      Jumanji
2  15602   1995-12-22    101.0             Grumpier Old Men
3  31357   1995-12-22    127.0            Waiting to Exhale
4  11862   1995-02-10    106.0  Father of the Bride Part II

In [5]:
ratings_df.head()

   userId  movieId  rating   timestamp
0       1      307     3.5  1256677221
1       1      481     3.5  1256677456
2       1     1091     1.5  1256677471
3       1     1257     4.5  1256677460
4       1     1449     4.5  1256677264

In [6]:
cast_df = cast_df.drop(columns="Unnamed: 0")
cast_df.head()

      id           name  order  gender  movie_id
0     31      Tom Hanks      0       2       862
1  12898      Tim Allen      1       2       862
2   7167    Don Rickles      2       2       862
3  12899     Jim Varney      3       2       862
4  12900  Wallace Shawn      4       2       862

In [7]:
crew_df = crew_df.drop(columns="Unnamed: 0")
crew_df.head()

             name         job  gender  movie_id
0   John Lasseter    Director       2       862
1     Joss Whedon  Screenplay       2       862
2  Andrew Stanton  Screenplay       2       862
3      Joel Cohen  Screenplay       2       862
4    Alec Sokolow  Screenplay       0       862

In [8]:
movies_df.head()

,movieId,Title,Year,Adventure,Action,Animation,Children,Comedy,Crime,Documentary,...,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western,No Listed Genre
0,1,Toy Story,1995.0,1,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji,1995.0,1,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men,1995.0,0,0,0,0,1,0,0,...,0,0,0,0,1,0,0,0,0,0
3,4,Waiting to Exhale,1995.0,0,0,0,0,1,0,0,...,0,0,0,0,1,0,0,0,0,0
4,5,Father of the Bride Part II,1995.0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0

In [9]:
meta_df.count()

id              45130
release_date    45130
runtime         45130
title           45130
dtype: int64

In [10]:
ratings_df.count()

userId       27753444
movieId      27753444
rating       27753444
timestamp    27753444
dtype: int64

In [11]:
cast_df.count()

id          562474
name        562474
order       562474
gender      562474
movie_id    562474
dtype: int64

In [12]:
crew_df.count()

name        464314
job         464314
gender      464314
movie_id    464314
dtype: int64

In [13]:
movies_df.count()

movieId            58098
Title              57769
Year               57769
Adventure          58098
Action             58098
Animation          58098
Children           58098
Comedy             58098
Crime              58098
Documentary        58098
Drama              58098
Fantasy            58098
Film-Noir          58098
Horror             58098
IMAX               58098
Musical            58098
Mystery            58098
Romance            58098
Sci-Fi             58098
Thriller           58098
War                58098
Western            58098
No Listed Genre    58098
dtype: int64

In [14]:
meta_df = meta_df.drop_duplicates(keep="first")
ratings_df = ratings_df.drop_duplicates(keep="first")
cast_df = cast_df.drop_duplicates(keep="first")
crew_df = crew_df.drop_duplicates(keep="first")
movies_df = movies_df.drop_duplicates(keep="first")

In [15]:
meta_df = meta_df.dropna()
ratings_df = ratings_df.dropna()
cast_df = cast_df.dropna()
crew_df = crew_df.dropna()
movies_df = movies_df.dropna()

In [16]:
meta_df.count()

id              45100
release_date    45100
runtime         45100
title           45100
dtype: int64

In [17]:
ratings_df.count()

userId       27753444
movieId      27753444
rating       27753444
timestamp    27753444
dtype: int64

In [18]:
cast_df.count()

id          562044
name        562044
order       562044
gender      562044
movie_id    562044
dtype: int64

In [19]:
crew_df.count()

name        463706
job         463706
gender      463706
movie_id    463706
dtype: int64

In [20]:
movies_df.count()

movieId            57769
Title              57769
Year               57769
Adventure          57769
Action             57769
Animation          57769
Children           57769
Comedy             57769
Crime              57769
Documentary        57769
Drama              57769
Fantasy            57769
Film-Noir          57769
Horror             57769
IMAX               57769
Musical            57769
Mystery            57769
Romance            57769
Sci-Fi             57769
Thriller           57769
War                57769
Western            57769
No Listed Genre    57769
dtype: int64

In [25]:
# meta_df.to_csv("New_Data/movie_metadata_clean.csv", index=False)
# ratings_df.to_csv("New_Data/ratings_clean.csv", index=False)
# cast_df.to_csv("New_Data/cast_clean.csv", index=False)
# crew_df.to_csv("New_Data/crew_clean.csv", index=False)
# movies_df.to_csv("New_Data/movies_clean.csv", index=False)

In [ ]:
import password from config.py
db_address = ""

In [ ]:
# Write Metadata to PostgreSQL DB    
    db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/movie_data"
    engine = create_engine(db_string)
    meta_df.to_sql(name='movies', con=engine, if_exists='replace')
    
    rows_imported = 0
    start_time = time.time()
    for data in pd.read_csv(f'{file_dir}/ratings.csv', chunksize=1000000):

        print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
        data.to_sql(name='ratings', con=engine, if_exists='append')
        rows_imported += len(data)

        print(f'Done. {time.time() - start_time} total seconds elapsed')

In [ ]:
# Write Ratings to PostgreSQL DB   
    db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/movie_data"
    engine = create_engine(db_string)
    ratings_df.to_sql(name='movies', con=engine, if_exists='replace')
    
    rows_imported = 0
    start_time = time.time()
    for data in pd.read_csv(f'{file_dir}/ratings.csv', chunksize=1000000):

        print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
        data.to_sql(name='ratings', con=engine, if_exists='append')
        rows_imported += len(data)

        print(f'Done. {time.time() - start_time} total seconds elapsed')

In [ ]:
# Write Cast to PostgreSQL DB 
    db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/movie_data"
    engine = create_engine(db_string)
    cast_df.to_sql(name='movies', con=engine, if_exists='replace')
    
    rows_imported = 0
    start_time = time.time()
    for data in pd.read_csv(f'{file_dir}/ratings.csv', chunksize=1000000):

        print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
        data.to_sql(name='ratings', con=engine, if_exists='append')
        rows_imported += len(data)

        print(f'Done. {time.time() - start_time} total seconds elapsed')

In [ ]:
# Write Crew to PostgreSQL DB    
    db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/movie_data"
    engine = create_engine(db_string)
    crew_df.to_sql(name='movies', con=engine, if_exists='replace')
    
    rows_imported = 0
    start_time = time.time()
    for data in pd.read_csv(f'{file_dir}/ratings.csv', chunksize=1000000):

        print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
        data.to_sql(name='ratings', con=engine, if_exists='append')
        rows_imported += len(data)

        print(f'Done. {time.time() - start_time} total seconds elapsed')

In [ ]:
# Write Movies to PostgreSQL DB    
    db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/movie_data"
    engine = create_engine(db_string)
    movies_df.to_sql(name='movies', con=engine, if_exists='replace')
    
    rows_imported = 0
    start_time = time.time()
    for data in pd.read_csv(f'{file_dir}/ratings.csv', chunksize=1000000):

        print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
        data.to_sql(name='ratings', con=engine, if_exists='append')
        rows_imported += len(data)

        print(f'Done. {time.time() - start_time} total seconds elapsed')